src/InformationRegisters/кд_НастройкиКонфиграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>кд_НастройкиКонфиграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КаталогИсходныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/кдМетаданные/Ext/Module.bsl
Функция ПолучитьКаталогиКонфигурации(Конфигурация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кд_НастройкиКонфиграции.КаталогИсходныхФайлов,
	|	кд_НастройкиКонфиграции.КаталогМетаданных
	|ИЗ
	|	РегистрСведений.кд_НастройкиКонфиграции КАК кд_НастройкиКонфиграции
	|ГДЕ
	|	кд_НастройкиКонфиграции.Конфигурация = &Конфигурация";
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("КаталогИсходныхФайлов,КаталогМетаданных");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Если ПустаяСтрока(Результат.КаталогМетаданных) Тогда
			Результат.КаталогМетаданных = Результат.КаталогИсходныхФайлов;
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Пропускает все вложенные узлы до конца указанного узла или только один узел, если имя узла не указано
Процедура ПропуститьУзелXML(ЧтениеXML, Знач ИмяУзла = Неопределено)
	Пока Истина Цикл
		ЧтениеXML.Пропустить(); // После выполнения - позиция на конец элемента
		Если ИмяУзла = Неопределено ИЛИ ЭтоКонецУзлаXML(ЧтениеXML, ИмяУзла) Тогда
			ЧтениеXML.Прочитать();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет, что сейчас начыинается указанный узел
Функция ЭтоУзелXML(ЧтениеXML, ИмяУзла)
	Возврат ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = ИмяУзла;
КонецФункции

// Проверяет, что сейчас заканчивается указанный узел
Функция ЭтоКонецУзлаXML(ЧтениеXML, ИмяУзла)
	Возврат ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = ИмяУзла;
КонецФункции

// Считывает соответствие имен узлов их обрабатываемым значениям
Функция ПрочитатьОписаниеСоответствия(ЧтениеXML, ИмяЭлемента)
	
	СоответствиеСвойств = Новый Соответствие;
	
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяСвойства = ЧтениеXML.Имя;
			ЗначениеСвойства = ПрочитатьЗначениеXML(ЧтениеXML);
			Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
				СоответствиеСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЧтениеXML.Прочитать();
	
	Возврат СоответствиеСвойств;
	
КонецФункции

Функция ПрочитатьОписаниеТипа(ЧтениеXML, ИмяЭлемента)
	
	ПростыеТипы = Новый Соответствие;
	ПростыеТипы.Вставить("xs:string", "Строка");
	ПростыеТипы.Вставить("xs:decimal", "Число");
	ПростыеТипы.Вставить("xs:boolean", "Булево");
	ПростыеТипы.Вставить("xs:dateTime", "Дата");
	
	ТипыСсылок = Новый Соответствие;
	ТипыСсылок.Вставить("cfg:EnumRef", "Перечисление");
	ТипыСсылок.Вставить("cfg:CatalogRef", "Справочник");
	ТипыСсылок.Вставить("cfg:DocumentRef", "Документ");
	//ТипыСсылок.Вставить("cfg:Characteristic", "");
	ТипыСсылок.Вставить("cfg:ChartOfCharacteristicTypesRef", "ПланВидовХарактеристик");
	
	// Чтение описания типов
	Типы = Новый Массив;
	
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Цикл
		
		Если ЭтоУзелXML(ЧтениеXML, "v8:Type") ИЛИ ЭтоУзелXML(ЧтениеXML, "v8:TypeSet") Тогда
			ТипXML = ПрочитатьЗначениеXML(ЧтениеXML);
			ПростойТип = ПростыеТипы[ТипXML];
			Если ПростойТип <> Неопределено Тогда
				Типы.Добавить(Тип(ПростойТип));
			Иначе
				КорневойТипXML = ирОбщий.ПервыйФрагментЛкс(ТипXML, ".");
				КорневойТип = ТипыСсылок[КорневойТипXML];
				Если КорневойТип = Неопределено Тогда
					Сообщить("Не известный тип " + ТипXML);
				Иначе
					Типы.Добавить(СтрЗаменить(ТипXML, КорневойТипXML, КорневойТип));
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПропуститьУзелXML(ЧтениеXML);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

Функция ПрочитатьЗначениеXML(ЧтениеXML)
	
	ИмяЭлемента = ЧтениеXML.Имя;
	ЧтениеXML.Прочитать();
	Если ЭтоКонецУзлаXML(ЧтениеXML, ИмяЭлемента) Тогда
		Значение = ""; // Пустой узел
	ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
		Значение = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	ИначеЕсли ЭтоУзелXML(ЧтениеXML, "v8:Type") ИЛИ ЭтоУзелXML(ЧтениеXML, "v8:TypeSet") Тогда
		Значение = ПрочитатьОписаниеТипа(ЧтениеXML, ИмяЭлемента);
	Иначе
		Сообщить("Найдено неизвестное описание значения " + ЧтениеXML.Имя);
		ЕстьОшибки = Истина;
		Пока ЭтоУзелXML(ЧтениеXML, ИмяЭлемента) Цикл
			ПропуститьУзелXML(ЧтениеXML);
		КонецЦикла;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция ПрочитатьPropertiesXML(ЧтениеXML, СписокПолей)
	
	ОписаниеЭлемента = Новый Структура(СписокПолей);
	
	ЧтениеXML.Прочитать();
	
	Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, "Properties") Цикл
		Если Найти(СписокПолей, ЧтениеXML.Имя) = 0 Тогда
			ПропуститьУзелXML(ЧтениеXML, ЧтениеXML.Имя);
		Иначе
			ИмяЗначения = ЧтениеXML.Имя;
			Значение = ПрочитатьЗначениеXML(ЧтениеXML);
			ОписаниеЭлемента.Вставить(ИмяЗначения, Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Прочитать();
	
	Возврат ОписаниеЭлемента;
	
КонецФункции

Функция ПрочитатьAttribute(ЧтениеXML, ТаблицаМетаданных, ПолноеИмяТЧ)
	
	Если НЕ ЭтоУзелXML(ЧтениеXML, "Attribute") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	ОписаниеЭлемента = ПрочитатьPropertiesXML(ЧтениеXML, "Name,Type");
	ЧтениеXML.Прочитать();
	
	СтрокаМетаданных = ТаблицаМетаданных.Добавить();
	СтрокаМетаданных.КорневойТип = ПолноеИмяТЧ + "Реквизит";
	СтрокаМетаданных.ПолноеИмя = ОписаниеЭлемента.Name;
	СтрокаМетаданных.Имя = ОписаниеЭлемента.Name;
	СтрокаМетаданных.Тип = ОписаниеЭлемента.Type;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьФайлМетаданных(КаталогиКонфигурации, ИмяФайла, ПолноеИмяОбъекта)
	
	СоответствиеКорневыхТипов = Новый Соответствие;
	СоответствиеКорневыхТипов.Вставить("ExchangePlan"              , "ПланОбмена");
	СоответствиеКорневыхТипов.Вставить("Constant"                  , "Константа");
	СоответствиеКорневыхТипов.Вставить("Catalog"                   , "Справочник");
	СоответствиеКорневыхТипов.Вставить("Document"                  , "Документ");
	//СоответствиеКорневыхТипов.Вставить("Sequence"                  , "Последовательность");
	СоответствиеКорневыхТипов.Вставить("Enum"                      , "Перечисление");
	СоответствиеКорневыхТипов.Вставить("ChartOfCharacteristicTypes", "ПланВидовХарактеристик");
	СоответствиеКорневыхТипов.Вставить("ChartOfAccounts"           , "ПланСчетов");
	СоответствиеКорневыхТипов.Вставить("ChartOfCalculationTypes"   , "ПланВидовРасчета");
	СоответствиеКорневыхТипов.Вставить("InformationRegister"       , "РегистрСведений");
	СоответствиеКорневыхТипов.Вставить("AccumulationRegister"      , "РегистрНакопления");
	СоответствиеКорневыхТипов.Вставить("AccountingRegister"        , "РегистрБухгалтерии");
	СоответствиеКорневыхТипов.Вставить("CalculationRegister"       , "РегистрРасчета");
	СоответствиеКорневыхТипов.Вставить("BusinessProcess"           , "БизнесПроцесс");
	СоответствиеКорневыхТипов.Вставить("Task"                      , "Задача");
	
	ТаблицаМетаданных = Новый ТаблицаЗначений;
	ТаблицаМетаданных.Колонки.Добавить("КорневойТип"); // Вид объекта - "Справочник", "Реквизит", "ТабличнаяЧасть", "ТабличнаяЧасть.<имя ТЧ>.Реквизит"
	ТаблицаМетаданных.Колонки.Добавить("ПолноеИмяРодителя"); // Метаданные родителя для подчиненных коллекций (реквизитов ТЧ, измерений, ...) - "ТабличнаяЧасть.<имя ТЧ>"
	ТаблицаМетаданных.Колонки.Добавить("ПолноеИмя"); // Полное имя - "Справочник.Валюты", "<имя реквизита>", "ТабличнаяЧасть.<имя ТЧ>", "<имя реквизита ТЧ>"
	ТаблицаМетаданных.Колонки.Добавить("Имя"); // имя - "Валюты", "<имя реквизита>", "<имя ТЧ>", "<имя реквизита ТЧ>"
	ТаблицаМетаданных.Колонки.Добавить("Тип");
	
	ПолноеИмяФайла = КаталогиКонфигурации.КаталогИсходныхФайлов + ПолучитьРазделительПути() + ИмяФайла + ".xml";
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.ОбъявлениеXML Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	Если ЭтоУзелXML(ЧтениеXML, "MetaDataObject") Тогда
		ЧтениеXML.Прочитать();
		ЧтениеXML.Прочитать();
		Пока НЕ ЭтоУзелXML(ЧтениеXML, "ChildObjects") Цикл
			ЧтениеXML.Пропустить();
			ЧтениеXML.Прочитать();
		КонецЦикла;
		ЧтениеXML.Прочитать();
		Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, "ChildObjects") Цикл
			Если ИмяФайла = "Configuration" Тогда
				КорневойТип = СоответствиеКорневыхТипов[ЧтениеXML.Имя];
				ИмяОбъекта = ПрочитатьЗначениеXML(ЧтениеXML);
				Если КорневойТип <> Неопределено Тогда
					СтрокаМетаданных = ТаблицаМетаданных.Добавить();
					СтрокаМетаданных.КорневойТип = КорневойТип;
					СтрокаМетаданных.ПолноеИмя = КорневойТип + "." + ИмяОбъекта;
					СтрокаМетаданных.Имя = ИмяОбъекта;
				КонецЕсли;
			Иначе
				//ПрочитатьКоллекциюXML(ЧтениеXML, "Attribute", "Реквизиты");
				Если НЕ ПрочитатьAttribute(ЧтениеXML, ТаблицаМетаданных, "") Тогда
					Если ЭтоУзелXML(ЧтениеXML, "TabularSection") Тогда
						ЧтениеXML.Прочитать();
						ПолноеИмяТЧ = "";
						Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, "TabularSection") Цикл
							Если ЭтоУзелXML(ЧтениеXML, "Properties") Тогда
								ОписаниеЭлемента = ПрочитатьPropertiesXML(ЧтениеXML, "Name");
								ПолноеИмяТЧ = "ТабличнаяЧасть." + ОписаниеЭлемента.Name;
								СтрокаМетаданных = ТаблицаМетаданных.Добавить();
								СтрокаМетаданных.КорневойТип = "ТабличнаяЧасть";
								СтрокаМетаданных.ПолноеИмяРодителя = ПолноеИмяОбъекта;
								СтрокаМетаданных.ПолноеИмя = ПолноеИмяТЧ;
								СтрокаМетаданных.Имя = ОписаниеЭлемента.Name;
							ИначеЕсли ЭтоУзелXML(ЧтениеXML, "ChildObjects") Тогда
								ЧтениеXML.Прочитать();
								Пока НЕ ЭтоКонецУзлаXML(ЧтениеXML, "ChildObjects") Цикл
									Если НЕ ПрочитатьAttribute(ЧтениеXML, ТаблицаМетаданных, ПолноеИмяТЧ + ".") Тогда
										ЧтениеXML.Прочитать();
									КонецЕсли;
								КонецЦикла;
								ЧтениеXML.Прочитать();
							Иначе
								ЧтениеXML.Пропустить();
								ЧтениеXML.Прочитать();
							КонецЕсли;
						КонецЦикла;
					Иначе
						ЧтениеXML.Пропустить();
					КонецЕсли;
					ЧтениеXML.Прочитать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
		
	КонецЕсли;
	
	ПолноеИмяФайла = ОбеспечитьКаталогиФайла(КаталогиКонфигурации.КаталогМетаданных + ПолучитьРазделительПути(), ИмяФайла + ".idx");
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТаблицаМетаданных);
	ЗаписьXML.Закрыть();
	
	Возврат ТаблицаМетаданных;
	
КонецФункции

Функция ОбеспечитьКаталогиФайла(КорневойКаталог, ИмяФайла)
	
	Разделитель = ПолучитьРазделительПути();
	КаталогФайла = КорневойКаталог;
	ЧастиФайла = СтроковыеФункции.РазложитьСтрокуВМассивПодстрок(ИмяФайла, ПолучитьРазделительПути());
	Для ИндексКаталога = 0 По ЧастиФайла.Количество() - 2 Цикл
		КаталогФайла = КаталогФайла + ЧастиФайла[ИндексКаталога] + Разделитель;
		ТестКаталог = Новый Файл(КаталогФайла);
		Если НЕ ТестКаталог.Существует() ИЛИ НЕ ТестКаталог.ЭтоКаталог() Тогда
			СоздатьКаталог(КаталогФайла);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КорневойКаталог + ИмяФайла;
	
КонецФункции

Функция ПолучитьТаблицуМетаданныхИзФайла(ОписаниеМетаданных)
	
	КаталогиКонфигурации = ПолучитьКаталогиКонфигурации(ОписаниеМетаданных["Конфигурация"]); // ПовтИсп
	Если КаталогиКонфигурации = Неопределено Тогда
		ВызватьИсключение "Не заданы каталоги для конфгурации " + ОписаниеМетаданных["Конфигурация"];
	КонецЕсли;
	
	ИмяФайла = ИмяФайлаПоМетаданным(ОписаниеМетаданных["ПолноеИмя"]); // ПовтИсп
	ПолноеИмяФайла = КаталогиКонфигурации.КаталогМетаданных + ПолучитьРазделительПути() + ИмяФайла + ".idx";
	ТестФайл = Новый Файл(ПолноеИмяФайла);
	Если ТестФайл.Существует() Тогда
		ТаблицаМетаданных = ирОбщий.ЗагрузитьЗначениеИзФайлаЛкс(ПолноеИмяФайла);
	Иначе
		ТаблицаМетаданных = ЗаполнитьФайлМетаданных(КаталогиКонфигурации, ИмяФайла, ОписаниеМетаданных["ПолноеИмя"]);
	КонецЕсли;
	
	Возврат ТаблицаМетаданных;
	
КонецФункции

Функция ПолучитьКоллекциюОбъектов(МетаданныеРодителя, ИмяКоллекции) Экспорт
	
	ТаблицаМетаданных = кд_глПолучитьМетаданныеИзКэша(МетаданныеРодителя);
	Если ТаблицаМетаданных = Неопределено Тогда
		ТаблицаМетаданных = ПолучитьТаблицуМетаданныхИзФайла(МетаданныеРодителя);
		кд_СохранитьМетаданныеВКэше(МетаданныеРодителя, ТаблицаМетаданных);
	КонецЕсли;
	
	НайденныеОбъекты = ТаблицаМетаданных.НайтиСтроки(Новый Структура("КорневойТип", ИмяКоллекции));
	
	Возврат НайденныеОбъекты;
	
КонецФункции

Функция ИмяФайлаПоМетаданным(ПолноеИмя)
	
	СоответствиеКорневыхТипов = Новый Соответствие;  // ПовтИсп
	СоответствиеКорневыхТипов.Вставить("ПланОбмена", "ExchangePlans");
	СоответствиеКорневыхТипов.Вставить("Константа", "Constants");
	СоответствиеКорневыхТипов.Вставить("Справочник", "Catalogs");
	СоответствиеКорневыхТипов.Вставить("Документ", "Documents");
	//СоответствиеКорневыхТипов.Вставить("Последовательность", "Sequence");
	СоответствиеКорневыхТипов.Вставить("Перечисление", "Enums");
	СоответствиеКорневыхТипов.Вставить("ПланВидовХарактеристик", "ChartsOfCharacteristicTypes");
	СоответствиеКорневыхТипов.Вставить("ПланСчетов", "ChartsOfAccounts");
	СоответствиеКорневыхТипов.Вставить("ПланВидовРасчета", "ChartsOfCalculationTypes");
	СоответствиеКорневыхТипов.Вставить("РегистрСведений", "InformationRegisters");
	СоответствиеКорневыхТипов.Вставить("РегистрНакопления", "AccumulationRegisters");
	СоответствиеКорневыхТипов.Вставить("РегистрБухгалтерии", "AccountingRegisters");
	СоответствиеКорневыхТипов.Вставить("РегистрРасчета", "CalculationRegisters");
	СоответствиеКорневыхТипов.Вставить("БизнесПроцесс", "BusinessProcesses");
	СоответствиеКорневыхТипов.Вставить("Задача", "Tasks");
	
	Если ПолноеИмя = Неопределено Тогда
		ИмяФайла = "Configuration";
	Иначе
		МассивФрагментов = ирОбщий.СтрРазделитьЛкс(ПолноеИмя);
		ИмяФайла = СоответствиеКорневыхТипов[МассивФрагментов[0]] + ПолучитьРазделительПути() + МассивФрагментов[1];
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции
